IDEA Open Model
LineLoad.DirectionType Property
Compatible with IDEA StatiCa v 10.1
 direction type of load
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public DirectionType DirectionType { get; set; }
Public Property DirectionType As DirectionType
	Get
	Set
public:
property DirectionType DirectionType {
	DirectionType get ();
	void set (DirectionType value);
}
Property Value
Type: DirectionType
See Also
Reference
LineLoad Class
IdeaRS.OpenModel.Detail.Loading Namespace